//
// Created by Наталья Белова on 30.11.2021.
//

#ifndef _4_EXTDATA_H
#define _4_EXTDATA_H

//------------------------------------------------------------------------------
// extdata.h - Описание внешних данных
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Раздел констант
//------------------------------------------------------------------------------
// Константа, определяющая размер натуральный числа
extern int const doubleSize;
// Константа, определяющая размер целого числа
extern int const intSize;
// Констанрта определяет размер char
extern int const charArraySize;
// Константа, задающая размер для процедурный язык
extern int const proverbSize;
// Константа, задающая размер для объект-ориентированый язык
extern int const puzzleSize;
// Константа, задающая размер для функциональный язык
extern int const aphorismSize;
// Константа, задающая размер для треугольника
extern int const wellOfWisdomSize;
// Константа, определяющая размерность массива фигур
extern int const maxSize;
// Константа, задающая признак процедурный язык
extern int const APHORISM;
// Константа, задающая признак объект-ориентированый язык
extern int const PROVERB;
// Константа, задающая признак функциональный язык
extern int const PUZZLE;

#endif //_4_EXTDATA_H
